app/controllers/wikis_controller.rb

  def index
    @wikis = Wiki.all
---
SELECT "wikis".* FROM "wikis"

  def show
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @wiki = Wiki.new
    @wiki.title = params[:wiki][:title]
    @wiki.body = params[:wiki][:body]

    if @wiki.save
---
INSERT INTO "wikis" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Wiki"], ["body", "And so it is.  As it was before."], ["created_at", "2016-10-01 22:28:05.981935"], ["updated_at", "2016-10-01 22:28:05.981935"]]

  def edit
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @wiki = Wiki.find(params[:id])
    @wiki.title = params[:wiki][:title]
    @wiki.body = params[:wiki][:body]

    authorize @wiki
    if @wiki.save
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "wikis" SET "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["body", "And so it is.  As it was before.\r\n\r\nAnd now it's edited."], ["updated_at", "2016-10-01 22:36:51.060865"], ["id", 1]]

  def destroy
    @wiki = Wiki.find(params[:id])

    if @wiki.destroy
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 1]]