app/controllers/wikis_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def edit
    @wiki = Wiki.find(params[:id])
    @collab_users = @wiki.collab_users.all